[
  {
    "title": "KED Talk on topic FREEDOM OF FEAR",
    "date": "August 17, 2017",
    "eventNum": 1,
    "slug": "events/ked-talk-freedom-of-fear",
    "image": "./images/events/ked-talk-freedom-of-fear.jpg",
    "description": "<p>SE and TE students stepped away from their regular schedules to attend the KED Talk which was organised by KC E-Cell. It was conducted by the speaker, Dr Raviprakash, Founder and Head Trainer, Happy Thoughts Foundation, Mumbai. In this interactive session, an insight was given to the students about Entrepreneurship.</p><p>This session was attended by TE IT and SE students. It commenced at 11:30 am with Dr Raviprakash being the featured speaker. This talk began with defining fear and causes of fear. The speaker interacted with the students by asking them to note down things that they fear. Further, students were randomly asked about the things that they had noted down, thus this session began with talks about fear eradication. A small talk about how fear is developed in the mind and how it destroys our confidence to succeed. Then, a small video on Sachin Tendulkar, describing how his fear took over his courage and his quest to play the game. Then, another interactive activity was conducted where the students were asked to state their fear and another student amongst them was asked to find out a solution to overcome it.</p><p>This talk concluded at around 1 am, with students coming out with a changed attitude and a mindset which was now truly free from fear, thus helping them to dive into Entrepreneurship without holding any fear, any further.</p>"
  },
  {
    "title": "ISDI DICE Bootcamp/Workshop.",
    "date": "September 13, 2017",
    "eventNum": 2,
    "slug": "events/isdi-dice-bootcamp",
    "image": "./images/events/isdi-dice-bootcamp.jpg",
    "description": "<p>The Enthusiastic students from KC College of Engineering, Thane (E) were present on Saturday, September 09, 2017 for the Workshop organized by Mr Vishal Samal, Assistant Vice President- Outreach, ISDI. The workshop, which had its name as DICE Bootcamp @ ISME, was conducted at ISDI (Indian School of Design and Innovation), Elphinstone road, Mumbai. In this, an insight was given to the students about Design, Innovation, Creativity and Entrepreneurship.</p><p>The workshop was attended by around 40 students from KC College of Engineering, who were accompanied by Prof Yogesh Karunakar, Head, EDC-KC. The workshop commenced at 10 am with Vishal Samal and Omkar P. being the featured speakers at this workshop. Mr Vishal gave the students, brief insights about the Entrepreneurship. Then, the next session was conducted by Mr Omkar, who held the audiences with his out of the box ideas and further, shared his experiences of being an entrepreneur, focusing on market scenarios and importance of public reviews. Further, an activity was conducted to design a dustbin for visually impaired people. This activity which went on for 45 minutes opened the minds of the students, with various unique ideas being implemented on this activity. After this, refreshments were provided and finally, the workshop was concluded at 1 pm.</p><p>On the whole, this workshop gave all the students, an insight to the basic idea about entrepreneurship and understanding the demands of the market. “Love the problems, not the ideas!”, these words by Mr Omkar struck a chord amongst the students, imbibing in them, the true sense of what an entrepreneur is expected to do. With this motivation and knowledge, students may now look forward to diving into entrepreneurship and do good for compensating the needs of the market.</p>"
  },
  {
    "title": "Drone Workshop in Association With Dronacharya Aviation PVT LTD.",
    "date": "September 15, 2017",
    "eventNum": 3,
    "slug": "events/drone-workshop",
    "image": "./images/events/drone-workshop.jpg",
    "description": "<p>Students freeing themselves from the shackles of their regular routine, were all set to touch the sky, thanks to the Drone workshop, which was organised by KC E-cell in association with Dronacharya Aviation Pvt Ltd. From this esteemed Drone firm, some members like Mr Tushar Pethe (Co- Founder), Mr Yash Patel(CTO), Mr Rohit Karle(CTO) and others were present to provide guidance about the drone technology, to all the aspiring engineers of KCCOE.</p><p>This workshop, which had a notable presence of FE students, was commenced at around 10:45 am, starting with the felicitation of Mr Tushar Pethe (Co-Founder, Dronacharya Aviation Pvt Ltd) and others, which was done by Prof Yogesh Karunakar, Head, EDC-KC. Further, the workshop started with an introductory video about Dronacharya Aviation Pvt Ltd and Mr Yash giving some brief details about the firm and its projects. Next, he introduced the audience to the brief classification of Drones and gave a detailed explanation about the Quadcopter and its all the basic components. Then, came the actual part of the workshop, where students began to assemble the drones in Quadcopter fashion, under the guidance of Mr Tushar, Mr Rohit and others. Mr Rohit, an enthusiastic engineer of this team, streamed the entire workshop live on his YouTube channel Rohit Fpv. A short break was given to all at 1 pm after which the aspiring KCCOE engineers completed the assembling and testing of their drones, all set to let them soar in the sky.</p><p>This workshop concluded with the August presence of Dr Harssh Khanna (Chairman), Dr Sai Kiran Khanna (MD) and lastly, an encouraging speech was given by Principal Dr Hansraj Guhilot, and then the drones were set to soar in the sky. Students tried flying their drones, under the guidance of Dronacharya members. Overall, this workshop gave an exposure to the students about the drone technology and hands on working gave them some experience regarding the same, which proved fruitful to them.</p>"
  },
  {
    "title": "KED Talk in association with Lithan PVT LTD.",
    "date": "September 28, 2017",
    "eventNum": 4,
    "slug": "events/ked-talk-with-lithan",
    "image": "./images/events/ked-talk-with-lithan.jpg",
    "description": "<p>The budding entrepreneurs aka students of KCCOE stepped away from their regular schedules to attend the KED Talk which was organised by KC E-Cell. It was conducted by the speaker, Mr Sandesh Shetty of Lithan Pvt Ltd. In this interactive session, an insight was given to the students about Entrepreneurship.</p><p>This session was attended by all the members of KC E-Cell along with their mentor, Prof Yogesh Karunakar, Head, EDC-KC. It commenced at 12 noon with Mr Sandesh being the featured speaker. This talk began with Introduction about Lithan Pvt Ltd and its contribution in the education system. Further, the session continued, wherein Mr Satish differentiated between a Businessman and Entrepreneur, in a very interesting fashion. Next up, he briefed up the audience with the characteristics and working attitude of an Entrepreneur. Then, there was a brief session conducted which revolved around the question ‘How to be an Entrepreneur?’ wherein, the Speaker explained Importance of problem understanding, Implementation of an idea, understanding of the market, three stages of a start-up, management of funds acquired, problems, challenges faced by a start-up and Importance of Mentors in the overall Entrepreneurial Journey of an individual. Then, there was an interactive activity conducted where the students were asked to pitch their ideas, to which the innovative minds of KCCOE responded enthusiastically.</p><p>This talk concluded at around 1.30 pm, with students coming out with a changed attitude and a whole lot of information about almost everything regarding the entrepreneurial world, thus helping them to dive into Entrepreneurship without holding any fear, any further.</p>"
  },
  {
    "title": "Seminar on topic Google Crowdsource",
    "date": "October 14, 2017",
    "eventNum": 5,
    "slug": "events/google-crowdsource-event",
    "image": "./images/events/google-crowdsource-event.jpg",
    "description": "<p>Students from all branches and spheres of KCCOE showed their enthusiastic spirit by participating in the Google Crowdsource Event, which was organized by KC E-Cell. This was an event, organized by ardent KC E-Cell members, Jayesh Behera and Rishabh Yadav, which received a whopping response from KCCOE students, as the attendance marked was above 100. This session was all about differentiating real and fake images and putting the service to work at its best.</p><p>This session was attended by around 105 students of KCCOE. It all began with a brief introduction about KC E-Cell and its activities, which was given by Rishabh Yadav, Member, KC E-Cell and then, the event was further hosted by Archana Yadav, Member, KC E-Cell. Then, the talk began around 10:30 am and was given by Ali Mustafa, CTO & Founder of Students Connect along with Aishwarya Muchandi and Saif Inamdar, the coordinators. The talk was interactive and it began with highlighting the importance of language and how it’s acting as a barrier between the people and the information. “Language should never be a barrier” the speaker highlighted. India being a secular country has different languages yet the information available on the Internet is mostly in English. Then the session started with its essence and paused at a competition asking the audience to download the Google Crowdsource app and begin their contribution. They were provided with Wi-Fi facility to participate and contribute. Also, they were given exciting Google goodies based on their contribution and score at the end. This entire event was also streamed live on Facebook and Instagram Page (@ecell_kccoe) of KC E-Cell, which marked E-Cell’s Social Media presence strongly.</p><p>The session ended with the participants coming out with the joy of getting a pot full of information in a day and also with an attitude of contributing for the good of the fellas and being a part of something that was out of the box.</p>"
  },
  {
    "title": "Seminar on Introduction to Machine Learning",
    "date": "November 15, 2017",
    "eventNum": 6,
    "slug": "events/intro-to-machine-learning",
    "image": "./images/events/intro-to-machine-learning.jpg",
    "description": "<p> Machine Learning is the need of this hour and Data Scientists are in high demand in the market. Understanding this very demand of the market, KCCOE introduced its students to the vast world of Machine Learning through an introductory seminar, which was organised by KC E-Cell, which saw a whopping response from the ever-enthusiastic crowd of the college. The seminar commenced at around 11:30 am, with Mr Vikramank Singh (Software Engineer, Facebook) and Mr Abdurrab Khan, as the featured speakers of this seminar.</p><p>This extraordinary session was attended by around 60 students and some enthusiastic faculties as well. Mr Vikramank, a Data Scientist at Facebook, was the key speaker of this session, where he started the session, by citing various underrated examples like the Recommendations Feed which is often seen on various Social media platforms like Facebook, a self-driving car by Google, etc. Further, he dived deep into the amazing concepts and algorithms which are the driving force of above mentioned underrated examples, thus introducing the audience to several concepts like Big Data, Machine Learning and Artificial Intelligence. In this entire session, the importance of Machine Learning and also, the scope of Python and R Programming Languages was prominently highlighted by the speaker.</p><p>This informative session went on for 2 hours and was concluded at around 1:30 pm, with the audience coming out with the joy of getting a pot full of information in a day and being a part of something that was out of the box.</p>"
  },
  {
    "title": "Entrepreneurship Summit in collab with IIT BOMBAY.",
    "date": "January 23, 2018",
    "eventNum": 7,
    "slug": "events/entrepreneurship-summit-with-iit-bombay",
    "image": "./images/events/entrepreneurship-summit-with-iit-bombay.jpg",
    "description": "<p>The budding entrepreneurs aka students of KCCOE stepped away from their regular schedules to attend the Mega Workshop which was organised by KC E-Cell in collaboration with E-Cell, IIT Bombay. It was presided by the speaker, Mr Krushna Praharaj, Honorary member, CSI. In this interactive session, an insight was given to the students about Entrepreneurship.</p><p>This session was attended by around 80 students from all branches and Semesters. It commenced at 2:15 pm with Mr Krushna P being felicitated by Prof Yogesh Karunakar, Head, EDC-KC. The talk began with the question ‘What is Entrepreneurship?’ in its simplest sense. Further, this interactive session continued, wherein the speaker emphasized on the thinking of an Entrepreneur, in a very interesting fashion. Then, there was a brief session conducted where the Speaker explained Importance of conceiving, prototyping and materializing an idea. The speaker stressed the importance of clear thinking, which holds the gist of Entrepreneurship. Also, the speaker spoke about Importance of Mentors, Capital, Marketing access, Entrepreneurial Meetups, Support systems and Competitive establishment and innovation in the product, which was the outcome of the very idea. Also, the speaker didn’t forget to mention the pitfalls in the Entrepreneurial journey like Lack of confidence and information, etc. On the whole, he showed the budding entrepreneurs, a roadmap for being a successful Entrepreneur. Lastly, he gave a brief introduction to the audience, about the CSI’s Incubator, which was like a shrine to the upcoming Entrepreneurs. This whole session was streamed live on the Instagram page of KC E-Cell.</p><p>This talk concluded at around 3 pm, with students coming out with a changed attitude and a whole lot of information about almost everything regarding the entrepreneurial world, thus helping them to dive into Entrepreneurship without holding any fear, any further.</p>"
  },
  {
    "title": "Seminar on Mobile Computing and 4G/5G Network Technology",
    "date": "January 26, 2018",
    "eventNum": 8,
    "slug": "events/mobile-computing-seminar",
    "image": "./images/events/mobile-computing-seminar.jpg",
    "description": "<p>The ever-enthusiastic crowd of KCCOE witnessed a revolutionary seminar, which gave an insight into Mobile Computing and 4G/5G Network, which was organised by IQAC and KC E-cell. The featured speaker of this fantastic seminar was Dr Alhad Kuwadekar, PhD- Mobile Computing, University of Glamorgan, UK (2010). This seminar began at around 12 noon, where at first, Dr Hansraj Guhilot, Principal, KCCOE, warmly welcomed the speaker by felicitating him and introduced the speaker to the audience present.</p><p>The audience of this mind-boggling seminar were Dr Hansraj Guhilot, Dr Sai Kiran Khanna, Dr Puja Rai, teachers, students and KC E-Cell members. The actual seminar started with the speaker introducing the audience to Mobile Computing, in which he highlighted the scarcity of memory. Further, Dr Alhad briefed up the audience about Mobile Communication and cited some basic applications of Mobile Computing, for instance, Self-driving vehicles, a sensor-based network for emergency cases, Follow-on services, Information services and many more. Then, before diving deeper into Mobile Computing and Communication, the speaker gave an overview about the History of Mobile phones, starting from 1982, where Mobika Senator was introduced to 2005, where 3G was introduced.</p><p>Further, he spoke about the features of the mobile phones, where the speaker highlighted that 90% of features remain unused still, the consumerism simply keeps on skyrocketing, thus giving the mobile companies, an upper hand over the consumers. Dr Alhad also mentioned the effects of Device Portability and gave a brief comparison between Wireless networks and Fixed networks. Thus, after introducing the audience to the concepts of Mobile Computing, a short break was taken for refreshment. But, there was already a lot of excitement amongst the audience for the next part of this seminar.</p><p>The seminar resumed at 2:45 pm, with the audience, refreshed and ready to look forward into what Dr Alhad was about to introduce them to. Seminar restarted with the concepts of Signal Propagation, Multiplexing & its different types, Cell structures and importance of frequency planning. Further, the speaker gave an overview of Cell Breathing and briefed up on CDMA Technology with a demonstrative example. Diving deeper into the concepts of networking, Dr Alhad mentioned the Drawbacks of PSTN and the rise of IP, factors affecting the mobile broadband and several concepts of 3G, 4G, SIP error responses, Proxy server, Back to Back User Agent (B2BUA) and Basic SIP Session setup.</p><p>After all of the conceptual talk, Dr Alhad introduced the showstopper of the seminar, Introduction to the Internet of Things (IoT). Live demonstrations of Smart Home solutions left the audiences in awe! Also, he gave some example of Smart Automation, Smart Health, etc. All these examples demonstrated were too relatable, with the concept of real world Problem Solving, which in turn, is the gist of Engineering as well as Entrepreneurship. Towards the end, Dr Alhad got his hands dirty on some real Android Programming demonstrations, which held the audiences, till the very end. This complete session was streamed live in three parts on Facebook and Instagram of KC E-Cell.</p><p>In this way, this meritorious and brainstorming seminar concluded at 5:20 pm, with audiences coming out with a lot of new information and knowledge, which was enough to give a kick-start to the generation of new ideas and innovation, which was some real motivation to ignite the passion of Problem Solving.</p>"
  },
  {
    "title": "KED Talk on Intrapreneur to Entrepreneur",
    "date": "August 14, 2018",
    "eventNum": 9,
    "slug": "events/intrapreneur-to-entrepreneur",
    "image": "./images/events/intrapreneur-to-entrepreneur.jpg",
    "description": "<p>The budding entrepreneurs aka students of KCCOE stepped away from their regular schedules to attend the KED Talk which was organized by KC E-Cell. It was conducted by two awesome speakers, Mr Sagar Bhosale (Director, MFC Restaurants Pvt Ltd.) and Mr Ashok Karkera (Senior Manager, L&D, TATA Capital Financial Services Ltd.). In this interactive session, an insight was given to the students about Intrapreneurship and Entrepreneurship.</p><p>This session was attended by 73 students from all branches of FE, SE and TE along with Prof Yogesh Karunakar, Head, EDC-KC, Prof Kshipra Naikare, Innovation Catalyst, KC E-cell and Prof Pratap Nair. This fun, interactive and knowledgeable seminar commenced at around 3:30 pm with Mr Ashok explaining the differences between Businessman & Entrepreneur and an Employee & an Intrapreneur. Further, Mr Ashok went deeper into the definition of Intrapreneurship and explained to the students present, “Why Intrapreneur is a Happy Slave?” Mr Ashok also emphasized the importance of Intrapreneurs and why their ideas are important and worth-trying with some well-known examples. Then, there was a brief session conducted by Mr Sagar at around 4:20 pm, which was a pretty fun and interactive session wherein, the Speaker explained Importance of enjoying the difficult path towards success, handling rejections tactfully, Importance of an idea and coining of the same, understanding of the market and the formal legalities, taking calculated risks, prompt usage of Social Media and avoiding misusage of privileges at hand in the overall Entrepreneurial Journey of an individual. It was overall, an interactive session, to which the innovative minds of KCCOE responded enthusiastically.</p><p>This talk concluded at around 5:15 pm, with students coming out with a changed attitude and a whole lot of information about with the basic knowledge of what is the difference between an Intrapreneur and an Entrepreneur and everything regarding the entrepreneurial world, thus helping them to dive into Entrepreneurship without holding any fear and taking calculated risks.</p>"
  },
  {
    "title": "Seminar & Workshop on AI and Cyber Security",
    "date": "August 25, 2018",
    "eventNum": 10,
    "slug": "events/ai-cyber-security-workshop",
    "image": "./images/events/ai-cybersecurity-workshop.jpg",
    "description": "<p>The ever-enthusiastic crowd of KCCOE witnessed a evolutionary seminar, which gave an insight into AI and Cybersecurity, which was organized by KC E-cell, in association with North Star Tech Advancement & Research. The featured speaker of this fantastic seminar was Mr Jaisingh Gupta, MD & CEO, North Star Tech Advancement & Research. This seminar began at around 12 noon, where at first, the speaker started with the introduction and definition of hacking and hackers.</p><p>The audience of this mind-boggling seminar were students of all branches from SE & TE and KC E-Cell members. The speaker introduced the audience to Polymorphic attacks, in which he highlighted the ease of hacking devices like Printers and Routers. Further, Mr Jaisingh briefed up the audience about various threats and vulnerabilities in Android Devices, Emails, Cloud services, etc, thus explaining the Current Cyber Threat Landscape, in which he highlighted that 60% of Android devices are not at all secure.</p><p>Further, he spoke about Cyber Security and the importance of Cyber Security experts. Mr Jaisingh emphasized the importance of being UpToDate in the profession of Cyber Security. Then, further, he mentioned the tools, ought to be present in the arsenal of Cyber Security professional, starting with precautions necessary to be taken. Further, the speaker introduced the audience to tools like CVE (Database of vulnerable devices), Metasploit and usage of Linux OS. Also, the speaker stated the fact that only 5% of organizations have access to good cybersecurity and that, 60% of companies were shut down due to hacking and thus, he came to explain the role of his firm, which helps the companies build business modules on a secure network. The speaker also mentioned the positive job scenario in the field of Cybersecurity. Thus, after introducing the audience to the concepts of Cybersecurity and Revolution 4.0, a short break was taken for refreshment. But, there was already a lot of excitement amongst the audience for the next part of this seminar, which was the AI workshop.</p><p> The seminar resumed at around 2 pm, with the audience, refreshed and ready to look forward into what Mr Jaisingh was about to introduce them to. Workshop restarted with the concepts of Basic Mathematics of 11th and 12th, Differentiation and Integration. Further, the speaker talked briefly about Sigmoid and various other functions and explained practically it’s implementation using python programming. This complete session was streamed live in two parts on Instagram of KC E-Cell.</p><p> In this way, this meritorious and brainstorming seminar concluded at around 4:45 pm, with audiences coming out with a lot of new information and knowledge, which was enough to give a kick-start to the generation of new ideas and innovation, which was some real motivation to ignite the passion of Problem Solving.</p>"
  }
]
